## cloud_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 3 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.neo4j will be updated in-place
  ~ resource "aws_ecs_service" "neo4j" {
        id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/cloud_asset_discovery/neo4j"
        name                               = "neo4j"
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/neo4j:10" -> (known after apply)
        # (15 unchanged attributes hidden)





        # (6 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.neo4j must be replaced
-/+ resource "aws_ecs_task_definition" "neo4j" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/neo4j:10" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  ~ image            = "neo4j:3.5.32@sha256:a5e2dc0ee57c7943342c981b5037c1bf961980f00fe8d6f6304d2b24102d6f5b" -> "neo4j:4.4.18@sha256:49420f700211821aafc8fe36f93f42c2d1a06550b173bbb8b40b228a9d85f6d0"
                    name             = "neo4j"
                  - volumesFrom      = [] -> null
                    # (7 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "neo4j" -> (known after apply)
      ~ revision                 = 10 -> (known after apply)
        tags                     = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)

      - volume {
          - name = "neo4j-efs-volume" -> null

          - efs_volume_configuration {
              - file_system_id          = "fs-098d5b30c68ae5525" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "ENABLED" -> null
              - transit_encryption_port = 0 -> null
            }
        }
      + volume {
          + name = "neo4j-efs-volume"

          + efs_volume_configuration {
              + file_system_id     = "fs-098d5b30c68ae5525"
              + root_directory     = "/"
              + transit_encryption = "ENABLED"
            }
        }
    }

  # aws_iam_role.list_accounts_in_org will be destroyed
  # (because aws_iam_role.list_accounts_in_org is not in configuration)
  - resource "aws_iam_role" "list_accounts_in_org" {
      - arn                   = "arn:aws:iam::794722365809:role/ListAccountsInOrg" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "states.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-01-19T21:11:57Z" -> null
      - description           = "Allows Step Functions to access AWS resources on your behalf." -> null
      - force_detach_policies = false -> null
      - id                    = "ListAccountsInOrg" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ListAccountsInOrg" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA3SCJE6FYXGN6YIM4L" -> null

      - inline_policy {
          - name   = "allowAssumptionOfOrgRole" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "sts:AssumeRole"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:iam::659087519042:role/assumeCartographyOrg"
                          - Sid      = "VisualEditor0"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy_attachment.list_accounts_in_org will be destroyed
  # (because aws_iam_role_policy_attachment.list_accounts_in_org is not in configuration)
  - resource "aws_iam_role_policy_attachment" "list_accounts_in_org" {
      - id         = "ListAccountsInOrg-arn:aws:iam::aws:policy/service-role/AWSLambdaRole" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaRole" -> null
      - role       = "ListAccountsInOrg" -> null
    }

Plan: 1 to add, 1 to change, 3 to destroy.

Warning: Argument is deprecated

  with aws_ecs_cluster.cloud_asset_discovery,
  on ecs.tf line 1, in resource "aws_ecs_cluster" "cloud_asset_discovery":
   1: resource "aws_ecs_cluster" "cloud_asset_discovery" {

Use the aws_ecs_cluster_capacity_providers resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
